
#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

Функция ПриИспользованииСЭДОЗагрузитьМЧД()
	
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда

		Sedo_ЭДОСФСС.ЗагрузитьМЧДСФР(); // Загрузка всех МЧД из СБИС
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;       
	
КонецФункции

&НаКлиенте
&Вместо("Загрузить")
Процедура Saby_Загрузить(Команда)

	Если ПриИспользованииСЭДОЗагрузитьМЧД() Тогда

		Элементы.Список.Обновить(); // Обновить данные списка МЧД на форме

	Иначе

		ПродолжитьВызов(Команда);

	КонецЕсли;

КонецПроцедуры

