
#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_sickleave_base_CommonModule_ИменаМодулейСерверСЭДО
#КонецОбласти

#Область ОтправкаСообщенияСЭДО

Функция ОтправитьСообщениеСЭДОЧерезAPIСБИС(ПараметрыСообщения) Экспорт

	Результат = Новый Структура("Отправлено, ОписаниеОшибки", Истина, "");	
	
	ПараметрыСообщенияЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	ОтпечаткиСертификатов = ПараметрыСообщенияЭДО.ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС(
		ПараметрыСообщения.Организация
	);
	ПараметрыСообщения.Вставить(
		"СертификатСтрахователяОтпечаток", 
		ОтпечаткиСертификатов.СертификатСтрахователяОтпечаток
	);	
	ПараметрыСообщения.Вставить("СсылкаМЧДФСС", Неопределено);
	Если ЗначениеЗаполнено(ОтпечаткиСертификатов.МЧД) Тогда
		СсылкаМЧДФСС = Справочники.МашиночитаемыеДоверенностиФСС.НайтиПоРеквизиту(
							"НомерДоверенности", ОтпечаткиСертификатов.МЧД);
		Если НЕ СсылкаМЧДФСС.Пустая() Тогда
			Если НЕ СсылкаМЧДФСС.Представитель_Физлицо Тогда
				Результат.Отправлено = Ложь;
				Результат.ОписаниеОшибки = "Представитель не является физ.лицом. Не поддерживаем отправку с таким типом МЧД!";
				Возврат Результат;
			КонецЕсли;
			Если Метаданные.НайтиПоТипу(ТипЗнч(СсылкаМЧДФСС.ЛицоБезДовФЛ)).Имя = "Контрагенты" Тогда
				Результат.Отправлено = Ложь;
				Результат.ОписаниеОшибки = "Физическое лицо со стороны доверителя является контрагентом."
										 + "Не поддерживаем отправку с таким типом МЧД!";
				Возврат Результат;
			КонецЕсли;
			ПараметрыСообщения.Вставить("СсылкаМЧДФСС", СсылкаМЧДФСС);
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		// Вызовите метод «СБИС.ЗаписатьКомплект» для подготовки документа к отправке.
		// На этом этапе документ появляется в списке больничных в СБИС
		Документ = ЗаписатьКомплект(ПараметрыСообщения);
		
		// Необходимо для отправки запроса в ФСС. На этом этапе передаем подписанный запрос
		// СБИС сразу запрос не отправляет, он делает это асинхронно. Запрос может уйти и через 30 минут
		ПодготовитьВыполнитьДействие(Документ, ПараметрыСообщения);
		
		// Сохраняем связь уида докумнета сбис и ссылки 1С
		ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
		ОбработкаСБИС.СтатусыДокументовОбновить(Документ["Идентификатор"], ПараметрыСообщения.СсылкаНаДокумент, "0");
		ОтправитьДействиеНаСерверСтатистики("Import", "Отправка проактивных больничных", ОбработкаСБИС);
	Исключение
		Результат.Отправлено = Ложь;
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Результат.ОписаниеОшибки = "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
		ОтправитьОшибкуНаСерверСтатистики("Import", "Отправка проактивных больничных", ОшибкаСтруктура);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции 

Функция ЗаписатьКомплект(ПараметрыСообщения)
	
	Попытка   
		Документ = ЗаписатьКомплектВызов(ПараметрыСообщения); // Записываем комплект
	Исключение 
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		// Если передали из 1С МЧД, которой ещё нет в СБИС, загрузим её и снова записываем этот же комплект.
		Если ЗначениеЗаполнено(ПараметрыСообщения.СсылкаМЧДФСС)
				И Найти(ВРег(ОшибкаСтруктура.message), "НЕ УДАЛОСЬ НАЙТИ МЧД") > 0 Тогда
			Попытка
				ЗагрузитьМЧДвСБИС(ПараметрыСообщения.СсылкаМЧДФСС); // Загружаем МЧД с СБИС
				Документ = ЗаписатьКомплектВызов(ПараметрыСообщения); // Повторяем вызов записи комплекта
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
				ОписаниеОшибки = "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
				ВызватьИсключение ОписаниеОшибки;
			КонецПопытки;
		Иначе
			ОписаниеОшибки = "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
	КонецПопытки;
	
	Возврат Документ;
	
КонецФункции

Функция ЗаписатьКомплектВызов(ПараметрыСообщения)
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	
	Комплект = ПолучитьСтруктуруОтправляемогоКомплекта( 
		ПараметрыСообщения
	);	
	РезультатЗаписиКомплекта = ОбработкаСБИС.local_helper_write_kit(context_params, Комплект); 
	
	Возврат РезультатЗаписиКомплекта[0] 
	
КонецФункции

Функция ПолучитьСтруктуруОтправляемогоКомплекта(ПараметрыСообщения)
	
	Комплект = Новый Структура;	

	Сотрудник = ПолучитьСотрудникаИзДокумента(ПараметрыСообщения.СсылкаНаДокумент);

	// Может есть фукнция API для получения идентификатора из СБИС. Если она есть, то лучше использовать её.
	Комплект.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор));
	Комплект.Вставить(
		"Расширение", 
		Новый Структура("ИдентификаторКомплекта", Строка(Новый УникальныйИдентификатор))
	);               
	Комплект.Вставить("Тип", "ДокументСЭДО");
	Комплект.Вставить("ПодТип", "");
	Комплект.Вставить("ДатаВремяСоздания", МестноеВремя(ТекущаяУниверсальнаяДата(), "Europe/Moscow"));
	
	НашаОрганизация = МодульЭДОСФССПовтИсп().Saby_НашаОрганизация(ПараметрыСообщения.Организация, Ложь);
	Комплект.Вставить("НашаОрганизация", НашаОрганизация);
				
	Участники = Новый Структура;
	// По организации без филиалов
	Если НЕ ПараметрыСообщения.Организация.ОбособленноеПодразделение Тогда
		Участники.Вставить("Отправитель", НашаОрганизация);
	Иначе
		// У филиала берём ГО, и сертификат должен быть от ГО!
		Участники.Вставить("Отправитель",
			МодульЭДОСФССПовтИсп().Saby_НашаОрганизация(ПараметрыСообщения.Организация.ГоловнаяОрганизация, Ложь));
	КонецЕсли;
	Участники.Вставить("Получатель", Новый Структура("ГосударственнаяИнспекция", "ЕФСС"));
	Участники.Вставить("КонечныйПолучатель", Новый Структура("ГосударственнаяИнспекция", "ЕФСС")); 
	Комплект.Вставить("Участники", Участники);
	
	Комплект.Вставить("Вложение", Новый Массив);
	Вложение = Новый Структура;
	Вложение.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор));
	Вложение.Вставить("Название", Строка(Сотрудник.Ссылка));
	Вложение.Вставить("Категория", "Основное");	
	Вложение.Вставить(
		"ПодТип", 
		МодульЭДОСФССПовтИсп().ПодтипВложенияПоТипуСообщения(ПараметрыСообщения.ТипСообщения)
	);	
	Вложение.Вставить("Направление", "Исходящий");	
	Вложение.Вставить(
		"ВерсияФормата",
		МодульЭДОСФССПовтИсп().ВерсияФорматаПоТипуСообщения(ПараметрыСообщения.ТипСообщения)
	);
	Вложение.Вставить("Файл", ПолучитьСтруктуруОтправляемогоФайла(ПараметрыСообщения));		
	Комплект.Вложение.Добавить(Вложение);
		
	Комплект.Вставить("Сертификат", Новый Структура);
	Комплект.Сертификат.Вставить("Отпечаток", ПараметрыСообщения.СертификатСтрахователяОтпечаток);
		
	
	Описание = Новый Структура;
	Описание.Вставить("ВидДокумента", "первичный");
	Описание.Вставить(
		"ИмяФормы",
		МодульЭДОСФССПовтИсп().ИмяФормыПоТипуСообщения(ПараметрыСообщения.ТипСообщения)
	);
	Описание.Вставить(
		"КНДФормы", 
		МодульЭДОСФССПовтИсп().ПодтипВложенияПоТипуСообщения(ПараметрыСообщения.ТипСообщения)
	);
	Описание.Вставить("КолФайл", "1"); 

	РеквизитыФизическогоЛица = ПолучитьРеквизитыФизическогоЛица(Сотрудник);

	Описание.Вставить("СНИЛС", get_prop(РеквизитыФизическогоЛица, "СНИЛС", ""));
	Описание.Вставить(
		"ФИО", 
		Новый Структура(
			"Имя, Отчество, Фамилия", 
			get_prop(РеквизитыФизическогоЛица, "Имя",      ""),
			get_prop(РеквизитыФизическогоЛица, "Отчество", ""),
			get_prop(РеквизитыФизическогоЛица, "Фамилия",  "")
		)
	);
	
	Сведения = Новый Структура;
	Сведения.Вставить("Описание", Описание);
	Сведения.Вставить(
		"Пакет", 
		Новый Структура(
			"ВерсПрог, ПрограммаФормированияОтчета", 
			Метаданные.Версия, 
			Метаданные.Имя
		)
	);    	
	// Данные по МЧД, если есть ссылка на элемент справочника
	Если ЗначениеЗаполнено(ПараметрыСообщения.СсылкаМЧДФСС) Тогда
		ДанныеМЧДФСС = ДанныеПоМЧДФСС(ПараметрыСообщения.СсылкаМЧДФСС);
		Доверенности = Новый Массив;
		Доверенности.Добавить(ДанныеМЧДФСС.Доверенность);
		Сведения.Вставить("Доверенность", Доверенности);
		Сведения.Пакет.Вставить("Доверенность", ДанныеМЧДФСС.ПакетДоверенность);
		Комплект.Участники.Отправитель = ДанныеМЧДФСС.Доверенность.ДоверенноеЛицо.Организация;
	КонецЕсли;
	
	Комплект.Вставить("Сведения", Сведения);
	
	Возврат Комплект;
		
КонецФункции

Функция ПолучитьСтруктуруОтправляемогоФайла(ПараметрыСообщения)
	
	СтруктураФайла = Новый Структура;
	СодержимоеСообщения = ?(
		ЭтоАдресВременногоХранилища(ПараметрыСообщения.СодержимоеИлиАдресСообщения),
		ПолучитьИзВременногоХранилища(ПараметрыСообщения.СодержимоеИлиАдресСообщения),
		ПараметрыСообщения.СодержимоеИлиАдресСообщения
	);
	
	ПотокВПамяти = Новый ПотокВПамяти;	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьПоток(ПотокВПамяти, "UTF-8", Ложь);
	// Добавляем объявление XML, если его нет в начале текста
	Если Найти(СодержимоеСообщения, "<?xml version=""1.0""") <> 1 Тогда
		ЗаписьXML.ЗаписатьОбъявлениеXML();
	КонецЕсли;
	ЗаписьXML.ЗаписатьБезОбработки(СодержимоеСообщения);
	ЗаписьXML.Закрыть();	
	
	ИмяФайла = СтрШаблон(
		"%1_%2_%3_%4.xml",
		МодульЭДОСФССПовтИсп().ПодтипВложенияПоТипуСообщения(ПараметрыСообщения.ТипСообщения),
		ПараметрыСообщения.РегистрационныйНомерФСС,
		Формат(ТекущаяДата(), "ДФ=yyyy_MM_dd"),
		Строка(Новый УникальныйИдентификатор)
	); 
	СтруктураФайла.Вставить("Имя", ИмяФайла); 
	
	СтруктураФайла.Вставить("ДвоичныеДанные", Base64Строка(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные()));
	
	Возврат СтруктураФайла
	
КонецФункции

Функция ВыполнитьINI(algorithm, endpoint, Параметры)
	
	Результат = Неопределено;
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	
	EndpointArgs = Новый Структура;
	Для Каждого Парам Из Параметры Цикл
		set_prop(Параметры, EndpointArgs, Парам.Ключ, Парам.Ключ);
	КонецЦикла;
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint, EndpointArgs", algorithm, endpoint, EndpointArgs);
	
	РезультатИни = ОбработкаСБИС.LocalCalcIni(ПараметрыКоманды);
	Если РезультатИни["Status"] = "error" Тогда
		ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
			РезультатИни.Result.detail, РезультатИни.Result.action);
	Иначе
		Результат = РезультатИни["Result"];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область include_sickleave_base_CommonModule_ПолучитьРеквизитыФизическогоЛица
#КонецОбласти

#Область include_sickleave_base_CommonModule_ПолучитьСотрудникаИзДокумента
#КонецОбласти

#Область include_sickleave_base_CommonModule_ДанныеМЧДФСС
#КонецОбласти

#КонецОбласти



#Область ПолучениеСпискаИзмененийИСпискаСлужебныхЭтапов

Функция СписокИзмененийПоДокументамСЭДО(context_params, Фильтр) Экспорт

	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	Если context_params.Количество() = 0 Тогда                              //при получении сообщений за период
		context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	КонецЕсли;
	Попытка
		СписокИзменений = ОбработкаСБИС.local_helper_read_changes(context_params, Фильтр);
		Если СписокИзменений["Навигация"]["ЕстьЕще"] <> "Да" Тогда
			ОтправитьДействиеНаСерверСтатистики("Export", "Получение проактивных больничных", ОбработкаСБИС, context_params);
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Если Найти(нрег(ОшибкаСтруктура.message), "не найдено событие с идентификатором")>0 Тогда
			Фильтр.Удалить("ИдентификаторСобытия");
			Попытка
				СписокИзменений = ОбработкаСБИС.local_helper_read_changes(context_params, Фильтр);
				Если СписокИзменений["Навигация"]["ЕстьЕще"] <> "Да" Тогда
					ОтправитьДействиеНаСерверСтатистики("Export", "Получение проактивных больничных", ОбработкаСБИС, context_params);
				КонецЕсли;
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
				ОтправитьОшибкуНаСерверСтатистики("Export", "Получение проактивных больничных", ОшибкаСтруктура,
					ОбработкаСБИС, context_params);
				ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
			КонецПопытки;
		Иначе
			ОтправитьОшибкуНаСерверСтатистики("Export", "Получение проактивных больничных", ОшибкаСтруктура,
				ОбработкаСБИС, context_params);
			ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
		КонецЕсли;
	КонецПопытки;
	Возврат СписокИзменений;
	
КонецФункции

Функция СписокСлужебныхЭтаповПоДокументамСЭДО(context_params, Фильтр) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	Если context_params.Количество() = 0 Тогда
		context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	КонецЕсли;
	Попытка
		СписокСлужебныхЭтапов = ОбработкаСБИС.local_helper_read_service_changes(context_params, Фильтр);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ОтправитьОшибкуНаСерверСтатистики("Export", "Получение проактивных больничных", ОшибкаСтруктура,
			ОбработкаСБИС, context_params);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;
	
	Возврат СписокСлужебныхЭтапов;
	
КонецФункции

#КонецОбласти


#Область ВспомогательныеФункции

&НаСервере
Процедура ЗагрузитьМЧДвСБИС(СсылкаМЧДФСС)
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	
	// Параметры для СБИС.ЗаписатьДокумент
	СтрокаФайлаМЧД = СсылкаМЧДФСС.ФайлВырузки.Получить();
	гуид = СсылкаМЧДФСС.НомерДоверенности;
	
	Файл = Новый Структура();
	Файл.Вставить("ДвоичныеДанные", Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаФайлаМЧД)));
	Файл.Вставить("Имя", "ON_EMCHD_" + гуид + ".xml");
	
	Вложение = Новый Структура;
	Вложение.Вставить("Идентификатор", гуид);
	Вложение.Вставить("Файл", Файл);
	
	Вложения = Новый Массив;
	Вложения.Добавить(Вложение);
	
	Документ = Новый Структура;
	Документ.Вставить("Тип", "Доверенность");
	Документ.Вставить("ДопПоля", "Расширение");
	Документ.Вставить("Регламент", Новый Структура("Идентификатор", ""));
	Документ.Вставить("Вложение", Вложения);
	
	Параметры = Новый Структура("Документ", Документ);
	
	Попытка
		// 1. Записываем доверенность с МЧД ФСС в СБИС
		context = context_params;
		kwargs = Новый Структура("multithread_mode, timeout", Ложь, 60);
	    headers = ОбработкаСБИС.local_helper_exec_method_get_headers_for_advanced_log(context);
		Если headers <> Неопределено Тогда
			kwargs.Вставить("headers", headers);
		КонецЕсли;
		response = ОбработкаСБИС.local_helper_exec_method(context, "СБИС.ЗаписатьДокумент", Параметры, Истина, kwargs);
		Результат = ОбработкаСБИС.local_helper_api_process_responce(response);
		
		// 2. Принудительно устанавливаем у неё признак регистрации в СФР
		Параметры = Новый Структура;
		Параметры.Вставить("DocumentID", Результат["Идентификатор"]);
		Параметры.Вставить("MchdType", "ФСС");
		Параметры.Вставить("Marked", "true");
		response = ОбработкаСБИС.local_helper_exec_method(context, "sabyMchd.MarkAsRegistered", Параметры, Истина, kwargs);
		Результат = ОбработкаСБИС.local_helper_api_process_responce(response);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьМЧДСФРПоОрганизации(Организация) Экспорт
	
	Навигация = Неопределено;
	
	Пока Истина Цикл
		// Получаем порцию МЧД из СБИС.СписокДокументов
		РезультатСписокДокументов = ПолучитьСписокДокументовМЧД(Организация, Навигация);
		Доки = РезультатСписокДокументов["Документ"];
		Навигация = РезультатСписокДокументов["Навигация"];
		Для Каждого Док Из Доки Цикл
			ИмяФайла = Док["Вложение"][0]["Файл"]["Имя"];
			гуидМЧД = ИмяФайла;
			гуидМЧД = СтрЗаменить(гуидМЧД, "powerOfAttorney_", "");
			гуидМЧД = СтрЗаменить(гуидМЧД, ".xml", "");
			СодержимоеФайла = Док["Вложение"][0]["Файл"]["СодержимоеФайла"];
			СпрМЧД = Справочники.МашиночитаемыеДоверенностиФСС.НайтиПоРеквизиту("НомерДоверенности", гуидМЧД);
			// Сохраняем в базе 1с, если таких нет
			Если СпрМЧД.Пустая() Тогда
				РезультатЗагрузки = ДокументооборотСКОВызовСервера.ЗагрузитьМЧДФСС(
					ПоместитьВоВременноеХранилище(СодержимоеФайла),
					Ложь);
				Если НЕ РезультатЗагрузки.Выполнено Тогда
					ЗаписьЖурналаРегистрации(
						ЛокализацияНазваниеПродукта() + ". Ошибка загрузки МЧД " + гуидМЧД + "." + РезультатЗагрузки.Ошибка,
						УровеньЖурналаРегистрации.Ошибка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Навигация["ЕстьЕще"] <> "Да" Тогда
			Прервать;
		Иначе
			Навигация.Вставить("Страница", Число(get_prop(Навигация, "Страница")) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьМЧДСФР() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиОбменаФСС.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.НастройкиОбменаФСС КАК НастройкиОбменаФСС
		|ГДЕ
		|	НастройкиОбменаФСС.ИспользоватьОбмен = Истина";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРЗ Из РезультатЗапроса Цикл
		Попытка
			ЗагрузитьМЧДСФРПоОрганизации(СтрокаРЗ.Организация);
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			// Не выводим ошибку, если нет прав на организацию в СБИСе или её там вообще нет
			Если Найти(ИнфоОбОшибке.Описание, "Не найдена действующая, доступная по правам наша организация") > 0 Тогда
				Продолжить;
			Иначе
				ВызватьИсключение;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСписокДокументовМЧД(Организация, Знач Навигация = Неопределено) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	
	Фильтр = Новый Структура();
	Фильтр.Вставить("Тип", "ДокументСЭДО");
	Фильтр.Вставить("Подтип", "МЧД");
	Фильтр.Вставить("Состояние", "Утвержденные");
	
	НашаОрганизация = МодульЭДОСФССПовтИсп().Saby_НашаОрганизация(Организация);
	Фильтр.Вставить("НашаОрганизация", НашаОрганизация);
	
	Если Навигация <> Неопределено
			И (ТипЗнч(Навигация) = Тип("Структура") ИЛИ ТипЗнч(Навигация) = Тип("Соответствие")) Тогда
		Фильтр.Вставить("Навигация", Навигация);
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("Фильтр", Фильтр);
	Попытка
		// Получаем данные по МЧД
		context = context_params;
		document = Параметры;
		kwargs = Новый Структура("multithread_mode, timeout", Ложь, 60);
	    headers = ОбработкаСБИС.local_helper_exec_method_get_headers_for_advanced_log(context);
		Если  headers <> Неопределено Тогда
			kwargs.Вставить("headers", headers);
		КонецЕсли;
		response = ОбработкаСБИС.local_helper_exec_method(context, "СБИС.СписокДокументов", document, Истина, kwargs);
		Результат = ОбработкаСБИС.local_helper_api_process_responce(response);
		// Скачиваем содержимое файлов МЧД
		Для Каждого Док Из Результат["Документ"] Цикл
			Ссылка = Док["Вложение"][0]["Файл"]["Ссылка"];
			СодержимоеФайла = ОбработкаСБИС.local_helper_download_from_link(context_params, Ссылка, "text");
			Док["Вложение"][0]["Файл"]["СодержимоеФайла"] = СодержимоеФайла;
		КонецЦикла;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ОтправитьДействиеНаСерверСтатистики(Действие, КонтекстДействия,
		ОбработкаСБИС = Неопределено, context_params = Неопределено)
		
	Если ОбработкаСБИС = Неопределено Тогда
		ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	КонецЕсли;
	
	Если context_params = Неопределено Тогда
		context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	КонецЕсли;
	
	ЭлементСтатистики = ОбработкаСБИС.local_helper_element_action(Действие, КонтекстДействия, Новый Структура(), 1);
	
	МассивУспехов = Новый Массив;
 	МассивУспехов.Добавить(ЭлементСтатистики);
	
	ОбработкаСБИС.local_helper_register_actions(context_params, МассивУспехов);
	
КонецПроцедуры

Процедура ОтправитьОшибкуНаСерверСтатистики(Действие, КонтекстДействия, ОшибкаСтруктура,
		ОбработкаСБИС = Неопределено, context_params = Неопределено)
		
	Если ОбработкаСБИС = Неопределено Тогда
		ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	КонецЕсли;
	
	Если context_params = Неопределено Тогда
		context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	КонецЕсли;
	
	ЭлементСтатистики = ОбработкаСБИС.local_helper_element_err(Действие, КонтекстДействия,
		ОшибкаСтруктура.message, ОшибкаСтруктура.detail, Новый Структура(), 500, 1);
	
	МассивОшибок = Новый Массив;
	МассивОшибок.Добавить(ЭлементСтатистики);
	
	ОбработкаСБИС.local_helper_register_errors(context_params, МассивОшибок);
	
КонецПроцедуры

#Область include_sickleave_base_CommonModule_ПолучитьЗначениеФункциональнойОпции
#КонецОбласти

Функция ПолучитьНастройкиПодключения() Экспорт
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.ПроверитьНаличиеПараметровПодключения();
	Возврат context_params;
КонецФункции

Функция ЗаписатьНастройкиПодключения(Ключ, Значение) Экспорт
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();	
	context_params.Вставить(Ключ, Значение);
	ОбработкаСБИС.НастройкиПодключенияЗаписать(context_params);
КонецФункции

Функция ПодготовитьВыполнитьДействие(Документ, ПараметрыСообщения) Экспорт

	РезультатВыполненияДействия = ПодготвитьДействие(Документ, ПараметрыСообщения);
	
	Возврат ВыполнитьДействие(РезультатВыполненияДействия, ПараметрыСообщения);
	
КонецФункции

Функция ПодготвитьДействие(Документ, ПараметрыСообщения) Экспорт

	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	
	ПодготовливаемоеДействие = ПолучитьСтруктуруПодготовливаемогоДействия(Документ, ПараметрыСообщения);
	Попытка
		Возврат ОбработкаСБИС.local_helper_prepare_action(
		context_params, 
		ПодготовливаемоеДействие
		);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;		
	
КонецФункции

Функция ВыполнитьДействие(РезультатПодготовкиДействия, ПараметрыСообщения) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
		
	ВыполняемоеДействие = ПолучитьСтруктуруВыполняемогоДействия(РезультатПодготовкиДействия, ПараметрыСообщения); 
	Попытка
		РезультатВыполненияДействия = ОбработкаСБИС.local_helper_execute_action(context_params, ВыполняемоеДействие);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;
	
	Возврат РезультатВыполненияДействия;
	
КонецФункции

Функция ОтложитьСлужебныйЭтап(Документ) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать();
	
	ОтложенноеДействие = ПолучитьСтруктуруПодготовливаемогоДействия(Документ, Неопределено);
	Попытка
		РезультатВыполнения = ОбработкаСБИС.local_helper_delay_service_stage(context_params, ОтложенноеДействие);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ВызватьИсключение "" + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ЗагрузитьСообщениеФССXMLИзСбис(СсылкаНаФайл, КодировкаUTF8 = Истина) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	context_params = ОбработкаСБИС.НастройкиПодключенияПрочитать(); 
	
	ФайлДокументаСЭДО = ОбработкаСБИС.local_helper_download_from_link(context_params, СсылкаНаФайл); 
	
	Если КодировкаUTF8 Тогда
		Чтение = Новый ЧтениеТекста(ФайлДокументаСЭДО.ОткрытьПотокДляЧтения(), КодировкаТекста.UTF8);
	Иначе
		Чтение = Новый ЧтениеТекста(ФайлДокументаСЭДО.ОткрытьПотокДляЧтения());
	КонецЕсли;
	СообщениеФССXML = Чтение.Прочитать();
	Чтение.Закрыть();
	
	Возврат СообщениеФССXML;
	
КонецФункции

Функция ЗаписатьУведомлениеОбОшибке(ИдентификаторЗапроса, Документ) Экспорт
	
	Попытка
		ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
		Выборка = ОбработкаСБИС.СтатусыДокументовПрочитатьПоUID(Документ["Идентификатор"]);
		Если Не Выборка.Следующий() Тогда
			Возврат Неопределено;
		КонецЕсли;
		Объект1С = Выборка.Объект;
		
		Объект1СОрганизация = get_prop(Объект1С, "Организация");
		Если Объект1СОрганизация = Неопределено Тогда
			Объект1СОрганизация = get_prop(Объект1С, "Страхователь");
		КонецЕсли;
		
		СообщениеОбОшибке = ЗагрузитьСообщениеФССXMLИзСбис(Документ["Событие"][0]["Вложение"][0]["Файл"]["Ссылка"], Ложь);
		
		РезультатОтправки = Новый Структура;
		РезультатОтправки.Вставить("ПолноеИмяДокумента",     Объект1С.Метаданные().ПолноеИмя());
		РезультатОтправки.Вставить("Ссылка",                 Объект1С.Ссылка);
		РезультатОтправки.Вставить("Страхователь",           Объект1СОрганизация);
		РезультатОтправки.Вставить("ГоловнаяОрганизация",    Объект1СОрганизация);
		РезультатОтправки.Вставить("ТекстОшибки",            СообщениеОбОшибке);
		РезультатОтправки.Вставить("ИдентификаторСообщения", ИдентификаторЗапроса);
		РезультатОтправки.Вставить("ИдентификаторПакета",    "");
		РезультатОтправки.Вставить("Успех",                  Ложь);
		РезультатОтправки.Вставить("ОтправленоОператору",    Ложь);
		РезультатОтправки.Вставить("ДоставленоФонду",        Ложь);
		РезультатОтправки.Вставить("ДатаОтправки",           ТекущаяДатаСеанса());
		РезультатОтправки.Вставить("ДатаОтправкиОператору",  '00010101');
		РезультатОтправки.Вставить("ДатаОтправкиФонду",      ТекущаяДатаСеанса());
		РезультатОтправки.Вставить("Измененные",             Новый Массив);
		
		СЭДОФСС.ЗарегистрироватьНепосредственныйРезультатОтправкиДокумента(РезультатОтправки);
		
		Возврат Новый Структура("ДокСсылка, СообщениеОбОшибке", Объект1С.Ссылка, СообщениеОбОшибке);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗаписатьSEDI_UUID(ИдентификаторЗапроса, Документ) Экспорт
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	Выборка = ОбработкаСБИС.СтатусыДокументовПрочитатьПоUID(Документ["Идентификатор"]);
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Объект1С = Выборка.Объект;
	
	Если СокрЛП(ТипЗнч(Объект1С)) = "Ответ страхователя на обращение СФР" Тогда
		ДокументОбъект = Объект1С.ПолучитьОбъект();
		ДокументОбъект.ДатаОтправки        = ТекущаяДатаСеанса();
		ДокументОбъект.ИдентификаторОтвета = ИдентификаторЗапроса;
		СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, Ложь, РежимЗаписиДокумента.Запись);
		Возврат Истина;
	КонецЕсли;
	
	// Фомируем строку списка, что бы 1С корректно обработала ответ и записала UUID в документ и нужные регистры.
	СтрокаСписка = Новый Структура;
	СтрокаСписка.Вставить("Ссылка", Объект1С);
	СтрокаСписка.Вставить("ДоставкаИдентификатор", ИдентификаторЗапроса);
	СтрокаСписка.Вставить("Доставлен", Истина);
	СтрокаСписка.Вставить("ДатаОтправки", ТекущаяДата());
	СтрокаСписка.Вставить("Результат", "");
	СтрокаСписка.Вставить("ЗначениеРасшифровки", "");
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
		Объект1С.Метаданные().ПолноеИмя()
	);
	Попытка
		Менеджер.ЗарегистрироватьРезультатыОтправки(СтрокаСписка, Новый Массив);
	Исключение
		// Новый вариант записи 
		Объект1СОрганизация = get_prop(Объект1С, "Организация");
		Если Объект1СОрганизация = Неопределено Тогда
			Объект1СОрганизация = get_prop(Объект1С, "Страхователь");
		КонецЕсли;
		СтрокаСписка.Вставить("Измененные", Новый Массив);
		СтрокаСписка.Вставить("Страхователь", Объект1СОрганизация);
		СтрокаСписка.Вставить("ГоловнаяОрганизация", Объект1СОрганизация.ГоловнаяОрганизация);
		СтрокаСписка.Вставить("ИдентификаторСообщения", ИдентификаторЗапроса);
		СтрокаСписка.Вставить("ДоставленоФонду", Истина);
		СтрокаСписка.Вставить("Успех", Истина);
		СтрокаСписка.Вставить("ДатаОтправкиФонду", ТекущаяДата());
		СтрокаСписка.Вставить("ТекстОшибки", "");
		СтрокаСписка.Вставить("ОтправленоОператору", Ложь);
		СтрокаСписка.Вставить("ДатаОтправкиОператору", Дата(1,1,1));
		СтрокаСписка.Вставить("ИдентификаторПакета", "");
		Менеджер.ЗарегистрироватьРезультатОтправки(СтрокаСписка);
	КонецПопытки;
	
КонецФункции


Функция ПолучитьСтруктуруПодготовливаемогоДействия(Знач Документ, ПараметрыСообщения)
	
	ПодготавливаемоеДействие = Новый Структура;
	
	ПодготавливаемоеДействие.Вставить("Идентификатор", Документ["Идентификатор"]); 
	ПодготавливаемоеДействие.Вставить("Тип", Документ["Тип"]);
	ПодготавливаемоеДействие.Вставить("ПодТип", ""); 
	ПодготавливаемоеДействие.Вставить("Этап", Новый Структура);
	
	ПодготавливаемоеДействие.Этап.Вставить("Название", Документ["Этап"][0]["Название"]); 
	ПодготавливаемоеДействие.Этап.Вставить("Идентификатор", Документ["Этап"][0]["Идентификатор"]); 
	
	ПодготавливаемоеДействие.Этап.Вставить("Действие", Новый Структура); 
	ПодготавливаемоеДействие.Этап.Действие.Вставить("Название", Документ["Этап"][0]["Действие"][0]["Название"]); 
	ПодготавливаемоеДействие.Этап.Действие.Вставить("Комментарий", ""); 
		
	Если ПараметрыСообщения <> Неопределено Тогда
		Сертификат = Новый Структура; 
		Сертификат.Вставить("Отпечаток", ПараметрыСообщения.СертификатСтрахователяОтпечаток); 
		Сертификат.Вставить("Ключ", Новый Структура("Тип", "Клиентский")); 
		ПодготавливаемоеДействие.Этап.Действие.Вставить("Сертификат", Сертификат);
	КонецЕсли;
		
	Возврат ПодготавливаемоеДействие;
		
КонецФункции

Функция ПолучитьСтруктуруВыполняемогоДействия(Знач РезультатПодготовкиДействия, ПараметрыСообщения)
			
	Если ПараметрыСообщения.Свойство("АдресПодписаногоЗапросаSOAP") Тогда
		РезультатПодготовкиДействия["Этап"][0]["Вложение"][0].Вставить("Подпись", Новый Массив);
		
		// BSLLS:MissingTempStorageDeletion-off
		СодержимоеСообщения = ПолучитьИзВременногоХранилища(ПараметрыСообщения.АдресПодписаногоЗапросаSOAP);
		// BSLLS:MissingTempStorageDeletion-on	
		СодержимоеСообщения = ПолучитьСтрокуИзДвоичныхДанных(СодержимоеСообщения);
		ПотокВПамяти = Новый ПотокВПамяти;	
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьПоток(ПотокВПамяти, "UTF-8", Ложь);
		// Добавляем объявление XML, если его нет в начале текста
		Если Найти(СодержимоеСообщения, "<?xml version=""1.0""") <> 1 Тогда
			ЗаписьXML.ЗаписатьОбъявлениеXML();
		КонецЕсли;
		ЗаписьXML.ЗаписатьБезОбработки(СодержимоеСообщения);
		ЗаписьXML.Закрыть();	
		СодержимоеСообщения = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
		
		Файл = Новый Структура;
		Файл.Вставить("Имя", РезультатПодготовкиДействия["Этап"][0]["Вложение"][0]["Файл"]["Имя"] + ".p7s");
		Файл.Вставить("ДвоичныеДанные", Base64Строка(СодержимоеСообщения));
		
		Подпись = Новый Структура;  
		Подпись.Вставить("Тип", "XMLFSS");
		Подпись.Вставить("Файл", Файл);
			
		РезультатПодготовкиДействия["Этап"][0]["Вложение"][0]["Подпись"].Добавить(Подпись); 
	КонецЕсли;
	
	Если ПараметрыСообщения.Свойство("АдресРасшифрованногоОтветаSOAP") Тогда
    	Файл = Новый Структура; 
		Файл.Вставить("Имя", РезультатПодготовкиДействия["Этап"][0]["Вложение"][0]["Файл"]["Имя"]);
		
		Поток = Новый ПотокВПамяти;
		Запись = Новый ЗаписьТекста;
		Запись.Открыть(Поток, КодировкаТекста.UTF8);
		Запись.Записать(ПолучитьИзВременногоХранилища(ПараметрыСообщения.АдресРасшифрованногоОтветаSOAP));
		Запись.Закрыть();
		
		Файл.Вставить(
			"ДвоичныеДанные", 
			Base64Строка(
				Поток.ЗакрытьИПолучитьДвоичныеДанные()	
			)
		);
		
		РезультатПодготовкиДействия["Этап"][0]["Вложение"][0]["Файл"] = Файл;
	КонецЕсли;
		
	Возврат РезультатПодготовкиДействия;
		
КонецФункции

Процедура СохранитьДатуОтправкиПодтвержденияОПрочтении(Организация, ИдентификаторыСообщений) Экспорт

	Для каждого ИдентификаторСообщения Из ИдентификаторыСообщений Цикл
		Запись = РегистрыСведений.ВходящиеСообщенияСЭДОФСС.СоздатьМенеджерЗаписи();
		Запись.Организация = Организация;
		Запись.Идентификатор = ИдентификаторСообщения.Идентификатор;
		Запись.Прочитать();
		Если НЕ Запись.ПодтверждениеОтправлено Тогда
			Запись.Организация = Организация;
			Запись.Идентификатор = ИдентификаторСообщения.Идентификатор;
			Запись.ДатаОтправкиПодтверждения = ИдентификаторСообщения.Дата;
			Запись.ПодтверждениеОтправлено = Истина;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_sickleave_base_CommonModule_ПриЗапускеСЭДО
#КонецОбласти
