
#Область include_sickleave_base_CommonModule_ИменаМодулейСерверСЭДО
#КонецОбласти

#Область include_sickleave_base_CommonModule_ИменаМодулейКлиентСЭДО
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяОбработки = ИмяОбработки();
 	ПутьКФормам = "Обработка."+ИмяОбработки+".Форма.";
	Возврат ПутьКФормам;
КонецФункции     

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность,,, ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаАвторизации(ОповещениеПослеПроверки) Экспорт
	ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("ПослеАутентификации", ЭтотОбъект, ОповещениеПослеПроверки);
	ОткрытьФормуОбработки("Вход", , , , ПроверкаВведенныхДанныхАутентификации); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ОповещениеПослеПроверки) Экспорт
	Если Результат <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПослеПроверки);
	Иначе
		ОписаниеОшибки = "Для выполнения действия необходимо авторизоваться в ." + ЛокализацияНазваниеПродукта();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Попытка
			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("Выполнено", Ложь);
			РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			РезультатВыполнения.Вставить("БылиОшибки", Истина);
			РезультатВыполнения.Вставить("ИдентификаторЗапроса", "");
			РезультатВыполнения.Вставить("ОшибкиПоОрганизациям", Новый Соответствие);
			РезультатВыполнения.Вставить("РезультатыПоОрганизациям", Новый Соответствие);
			ВыполнитьОбработкуОповещения(
				ОповещениеПослеПроверки.ДополнительныеПараметры.ОповещениеОбратногоВызова,
				РезультатВыполнения
			);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&Вместо("ОтправитьСообщениеСЭДО") 
// Отправляет произвольное сообщение на сервер СЭДО ФСС.
//
// Параметры:
//  ОповещениеОбратногоВызова - ОписаниеОповещения - описание процедуры, принимающей результат:
//    Результат                    - Структура:
//      * Выполнено            - Булево - признак успешного выполнения операции.
//      * ОписаниеОшибки       - Строка - содержит описание ошибки в случае, если Выполнено установлено в Ложь.
//      * ИдентификаторЗапроса - Строка - идентификатор отправленного запроса.
//  ПараметрыСообщения             - Структура - параметры отправки сообщения со структурой, как формируется функцией
//                                               "ЭлектронныйДокументооборотСФСС.ПараметрыОтправитьСообщениеСЭДО"
//  ЗадаватьВопросОТестовомСервере - Булево    - показывать вопрос, если установлен тестовый режим,
//                                               по умолчанию Истина, в случае серии вызовов для непервого вызова
//                                               стоит задавать Ложь.
//
Процедура Saby_ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере)
	
	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = МодульЭДОСФСС().ПолучитьНастройкиПодключения();
		Если context_params <> Неопределено Тогда
			МодульЭДОСФССКлиент().ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);
		Иначе
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("ПараметрыСообщения", ПараметрыСообщения);
			ОповещениеПослеПроверки = Новый ОписаниеОповещения("ОповещениеОтправитьСообщениеСЭДО",
												МодульЭДОСФССКлиент(), ПараметрыМетода);
			ПроверкаАвторизации(ОповещениеПослеПроверки);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьВходящиеСообщенияСЭДОФСС")
Процедура Saby_ПолучитьВходящиеСообщенияСЭДОФСС(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия)
 
	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = МодульЭДОСФСС().ПолучитьНастройкиПодключения();
		Если context_params <> Неопределено Тогда
			МодульЭДОСФССКлиент().ПолучитьВходящиеСообщенияСЭДО(ОповещениеОбратногоВызова, Организации);
		Иначе
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("Организации", Организации);
			ОповещениеПослеПроверки = Новый ОписаниеОповещения("ОповещениеПолучитьВходящиеСообщенияСЭДО",
												МодульЭДОСФССКлиент(), ПараметрыМетода);
			ПроверкаАвторизации(ОповещениеПослеПроверки);
		КонецЕсли;
	Иначе 
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьСообщенияСЭДО")
Процедура Saby_ПолучитьСообщенияСЭДО(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий)
	  
	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = МодульЭДОСФСС().ПолучитьНастройкиПодключения();
		Если context_params <> Неопределено Тогда
			МодульЭДОСФССКлиент().ПолучитьСообщенияСЭДО(ОповещениеОбратногоВызова, Организация, Идентификаторы);
		Иначе
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("Организация", Организация);
			ПараметрыМетода.Вставить("Идентификаторы", Идентификаторы);
			ОповещениеПослеПроверки = Новый ОписаниеОповещения("ОповещениеПолучитьСообщенияСЭДО",
												МодульЭДОСФССКлиент(), ПараметрыМетода);
			ПроверкаАвторизации(ОповещениеПослеПроверки);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОтправитьПодтверждениеОПолученииСообщенийСЭДО")
Процедура Saby_ОтправитьПодтверждениеОПолученииСообщенийСЭДО(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие)
	
	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = МодульЭДОСФСС().ПолучитьНастройкиПодключения();
		Если context_params <> Неопределено Тогда
			МодульЭДОСФССКлиент().ОтправитьПодтверждениеОПолученииСообщенийСЭДО(
				ОповещениеОбратногоВызова, 
				Организация, 
				ИдентификаторыСообщений
			);
		Иначе
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("Организация", Организация);
			ПараметрыМетода.Вставить("ИдентификаторыСообщений", ИдентификаторыСообщений);
			ОповещениеПослеПроверки = Новый ОписаниеОповещения("ОповещениеОтправитьПодтверждениеОПолученииСообщенийСЭДО",
												МодульЭДОСФССКлиент(), ПараметрыМетода);
			ПроверкаАвторизации(ОповещениеПослеПроверки);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие);
	КонецЕсли; 
	
КонецПроцедуры

#Область include_sickleave_base_CommonModule_ЭлектронныйДокументооборотСФССКлиент_ПолучитьСообщенияСЭДОЗаПериод
#КонецОбласти
