 
&Вместо("ОтправитьСообщениеСЭДО") 
// Отправляет произвольное сообщение на сервер СЭДО ФСС.
//
// Параметры:
//  ОповещениеОбратногоВызова - ОписаниеОповещения - описание процедуры, принимающей результат:
//    Результат                    - Структура:
//      * Выполнено            - Булево - признак успешного выполнения операции.
//      * ОписаниеОшибки       - Строка - содержит описание ошибки в случае, если Выполнено установлено в Ложь.
//      * ИдентификаторЗапроса - Строка - идентификатор отправленного запроса.
//  ПараметрыСообщения             - Структура - параметры отправки сообщения со структурой, как формируется функцией
//                                               "ЭлектронныйДокументооборотСФСС.ПараметрыОтправитьСообщениеСЭДО"
//  ЗадаватьВопросОТестовомСервере - Булево    - показывать вопрос, если установлен тестовый режим,
//                                               по умолчанию Истина, в случае серии вызовов для непервого вызова
//                                               стоит задавать Ложь.
//
Процедура Saby_ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере)
	
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		Saby_ЭДОСФССКлиент.ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);	
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьВходящиеСообщенияСЭДОФСС")
Процедура Saby_ПолучитьВходящиеСообщенияСЭДОФСС(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия)
 
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		Saby_ЭДОСФССКлиент.ПолучитьВходящиеСообщенияСЭДО(ОповещениеОбратногоВызова, Организации);
	Иначе 
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьСообщенияСЭДО")
Процедура Saby_ПолучитьСообщенияСЭДО(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий)
	  
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		Saby_ЭДОСФССКлиент.ПолучитьСообщенияСЭДО(ОповещениеОбратногоВызова, Организация, Идентификаторы);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОтправитьПодтверждениеОПолученииСообщенийСЭДО")
Процедура Saby_ОтправитьПодтверждениеОПолученииСообщенийСЭДО(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие)
	
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		Saby_ЭДОСФССКлиент.ОтправитьПодтверждениеОПолученииСообщенийСЭДО(
		ОповещениеОбратногоВызова, 
		Организация, 
		ИдентификаторыСообщений
		);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие);
	КонецЕсли; 
	
КонецПроцедуры

&Вместо("ПолучитьСообщенияСЭДОЗаПериод")
Процедура Saby_ПолучитьСообщенияСЭДОЗаПериод(ОповещениеОбратногоВызова,
		Организации,
		ДатаНачала,
		ДатаОкончания,
		ПараметрыПолучения)
	
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		Saby_ЭДОСФССКлиент.ПолучитьСообщенияСЭДОЗаПериод(ОповещениеОбратногоВызова,
			Организации, ДатаНачала, ДатаОкончания, ПараметрыПолучения);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ДатаНачала, ДатаОкончания, ПараметрыПолучения);
	КонецЕсли;
	
КонецПроцедуры
