
#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяОбработки = ИмяОбработки();
 	ПутьКФормам = "Обработка."+ИмяОбработки+".Форма.";
	Возврат ПутьКФормам;
КонецФункции     

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность,,, ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыОбщийМодуль
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФункциональныеФормы
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ОписаниеОповещения
#КонецОбласти

&Вместо("ОтправитьСообщениеСЭДО") 
// Отправляет произвольное сообщение на сервер СЭДО ФСС.
//
// Параметры:
//  ОповещениеОбратногоВызова - ОписаниеОповещения - описание процедуры, принимающей результат:
//    Результат                    - Структура:
//      * Выполнено            - Булево - признак успешного выполнения операции.
//      * ОписаниеОшибки       - Строка - содержит описание ошибки в случае, если Выполнено установлено в Ложь.
//      * ИдентификаторЗапроса - Строка - идентификатор отправленного запроса.
//  ПараметрыСообщения             - Структура - параметры отправки сообщения со структурой, как формируется функцией
//                                               "ЭлектронныйДокументооборотСФСС.ПараметрыОтправитьСообщениеСЭДО"
//  ЗадаватьВопросОТестовомСервере - Булево    - показывать вопрос, если установлен тестовый режим,
//                                               по умолчанию Истина, в случае серии вызовов для непервого вызова
//                                               стоит задавать Ложь.
//
Процедура Saby_ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере)
	
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
		ПараметрыМетода.Вставить("ПараметрыСообщения", ПараметрыСообщения);
		ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеОтправитьСообщениеСЭДО",
											Sedo_ЭДОСФССКлиент, ПараметрыМетода);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, ПараметрыСообщения, ЗадаватьВопросОТестовомСервере);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьВходящиеСообщенияСЭДОФСС")
Процедура Saby_ПолучитьВходящиеСообщенияСЭДОФСС(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия)
 
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
		ПараметрыМетода.Вставить("Организации", Организации);
		ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеПолучитьВходящиеСообщенияСЭДО",
											Sedo_ЭДОСФССКлиент, ПараметрыМетода);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
	Иначе 
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьСообщенияСЭДО")
Процедура Saby_ПолучитьСообщенияСЭДО(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий)
	  
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
		ПараметрыМетода.Вставить("Организация", Организация);
		ПараметрыМетода.Вставить("Идентификаторы", Идентификаторы);
		ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеПолучитьСообщенияСЭДО",
											Sedo_ЭДОСФССКлиент, ПараметрыМетода);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, Идентификаторы, ОткрыватьФормуДлительнойОперации, ЗадаватьВопросОТестовомСервере, ТипыВзаимодействий);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОтправитьПодтверждениеОПолученииСообщенийСЭДО")
Процедура Saby_ОтправитьПодтверждениеОПолученииСообщенийСЭДО(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие)
	
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
		ПараметрыМетода.Вставить("Организация", Организация);
		ПараметрыМетода.Вставить("ИдентификаторыСообщений", ИдентификаторыСообщений);
		ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеОтправитьПодтверждениеОПолученииСообщенийСЭДО",
											Sedo_ЭДОСФССКлиент, ПараметрыМетода);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организация, ИдентификаторыСообщений, ПослеОтправкиПолучитьВходящие);
	КонецЕсли; 
	
КонецПроцедуры

#Область include_sickleave_base_CommonModule_ЭлектронныйДокументооборотСФССКлиент_ПолучитьСообщенияСЭДОЗаПериод
#КонецОбласти
