
&Вместо("ПолучитьСообщенияСЭДОЗаПериод")
Процедура Sedo_ПолучитьСообщенияСЭДОЗаПериод(ОповещениеОбратногоВызова,
		Организации,
		ДатаНачала,
		ДатаОкончания,
		ПараметрыПолучения)

	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
		ПараметрыМетода.Вставить("Организации", Организации);
		ПараметрыМетода.Вставить("ДатаНачала", ДатаНачала);
		ПараметрыМетода.Вставить("ДатаОкончания", ДатаОкончания);
		ПараметрыМетода.Вставить("ПараметрыПолучения", ПараметрыПолучения);
		ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеПолучитьСообщенияСЭДОЗаПериод",
											Sedo_ЭДОСФССКлиент, ПараметрыМетода);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ДатаНачала, ДатаОкончания, ПараметрыПолучения);
	КонецЕсли;

КонецПроцедуры

