
&Вместо("ПолучитьСообщенияСЭДОЗаПериод")
Процедура Sedo_ПолучитьСообщенияСЭДОЗаПериод(ОповещениеОбратногоВызова,
		Организации,
		ДатаНачала,
		ДатаОкончания,
		ПараметрыПолучения)

	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда
		context_params = МодульЭДОСФСС().ПолучитьНастройкиПодключения();
		Если context_params <> Неопределено Тогда
			МодульЭДОСФССКлиент().ПолучитьСообщенияСЭДОЗаПериод(ОповещениеОбратногоВызова,
				Организации, ДатаНачала, ДатаОкончания, ПараметрыПолучения);
		Иначе
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("Организации", Организации);
			ПараметрыМетода.Вставить("ДатаНачала", ДатаНачала);
			ПараметрыМетода.Вставить("ДатаОкончания", ДатаОкончания);
			ПараметрыМетода.Вставить("ПараметрыПолучения", ПараметрыПолучения);
			ОповещениеПослеПроверки = Новый ОписаниеОповещения("ОповещениеПолучитьСообщенияСЭДОЗаПериод",
												МодульЭДОСФССКлиент(), ПараметрыМетода);
			ПроверкаАвторизации(ОповещениеПослеПроверки);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ДатаНачала, ДатаОкончания, ПараметрыПолучения);
	КонецЕсли;

КонецПроцедуры

