
#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

Функция ПриИспользованииСЭДОЗагрузитьМЧД()
	
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда

		Попытка
			Орг = ЭтотОбъект.ОрганизацияОтбора;
		Исключение
			Орг = Неопределено;
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(Орг) Тогда
			Попытка
				Орг = ЭтотОбъект.ВладелецФормы.Запись.Организация;
			Исключение
				Орг = Неопределено;
			КонецПопытки
		КонецЕсли;

		Если ЗначениеЗаполнено(Орг) Тогда
			Sedo_ЭДОСФСС.ЗагрузитьМЧДСФРПоОрганизации(Орг);
		Иначе
			// Загрузка по всем организациям в настройках
			Sedo_ЭДОСФСС.ЗагрузитьМЧДСФР();
		КонецЕсли;

		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;       
	
КонецФункции

&НаКлиенте
&Вместо("Загрузить")
Процедура Saby_Загрузить(Команда)

	Если ПриИспользованииСЭДОЗагрузитьМЧД() Тогда

		Элементы.Список.Обновить(); // Обновить данные списка МЧД на форме

	Иначе

		ПродолжитьВызов(Команда);

	КонецЕсли;

КонецПроцедуры

