
&НаКлиенте
&Вместо("Загрузить")
Процедура Saby_Загрузить(Команда)

	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда

		Попытка
			Орг = ЭтотОбъект.ОрганизацияОтбора;
		Исключение
			Орг = Неопределено;
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(Орг) Тогда
			Попытка
				Орг = ЭтотОбъект.ВладелецФормы.Запись.Организация;
			Исключение
				Орг = Неопределено;
			КонецПопытки
		КонецЕсли;

		Если ЗначениеЗаполнено(Орг) Тогда
			Saby_ЭДОСФСС.ЗагрузитьМЧДСФРПоОрганизации(Орг);
		Иначе
			// Загрузка по всем организациям в настройках
			Saby_ЭДОСФСС.ЗагрузитьМЧДСФР();
		КонецЕсли;

		Элементы.Список.Обновить(); // Обновить данные списка МЧД на форме

	Иначе

		ПродолжитьВызов(Команда);

	КонецЕсли;

КонецПроцедуры

