
&НаКлиенте
&Вместо("ОтправитьСообщениеСЭДОФСС")
Процедура Saby_ОтправитьСообщениеСЭДОФССЧерезОбработку(ПараметрыСообщения,
		ЗадаватьВопросОТестовомСервере, 
		ОтображатьСостояние,
		ВыводитьДиалогСостоянияОтправки,
		СвойстваОбменаПоСЭДОЧерезОператора)
		
	Если Saby_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции("Saby_ИспользоватьЭЛН") Тогда
		ПараметрыСообщения.Вставить("СсылкаНаДокумент",
										ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка);
		ПараметрыСообщения.Вставить("СодержимоеИлиАдресСообщения",
										ПараметрыСообщения.СодержимоеСообщения);
		ПараметрыСообщения.Вставить("РегистрационныйНомерФСС", 
										Saby_ЭДОСФССПовтИсп.Saby_РегистрационныйНомерСФР(ПараметрыСообщения.Организация));
		ОповещениеОбратногоВызова = Новый ОписаниеОповещения(
			ПараметрыСообщения.ОповещениеОбратногоВызова.ИмяПроцедуры,
			ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль,
			Новый Структура);
		ПараметрыСообщения.Удалить("ОповещениеОбратногоВызова");
		Saby_ЭДОСФССКлиент.ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);
	Иначе
		ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние, ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
	КонецЕсли;
	
КонецПроцедуры
