
#Область include_sickleave_base_CommonModule_ИменаМодулейСерверСЭДО
#КонецОбласти

#Область include_sickleave_base_CommonModule_ИменаМодулейКлиентСЭДО
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

Функция ИспользоватьСЭДО()
	
	Если МодульЭДОСФСС().ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда

		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;       
	
КонецФункции

Функция РегистрационныйНомерСФР(Организация)
	
	Возврат МодульЭДОСФССПовтИсп().Saby_РегистрационныйНомерСФР(Организация);
	
КонецФункции

#Область include_sickleave_base_DataProcessor_ДокументооборотСКонтролирующимиОрганами_Form_КонтейнерКлиентскихМетодов_ОтправитьСообщениеСЭДОФСС
#КонецОбласти

&НаКлиенте
&Перед("ПодписатьФайлXMLDSig")
Процедура Sedo_ПодписатьФайлXMLDSig(СертификатПодписанта, ФайлДанных, ВыполняемоеОповещение, Знач ПодписанныйФайл, Кодировка, НастройкиПодписи)
	
	Если ТипЗнч(НастройкиПодписи) = Тип("Структура") Тогда
		Если НастройкиПодписи.Свойство("НеВключатьЗаголовокXML") = Истина Тогда
			Попытка
				Если ВыполняемоеОповещение.ДополнительныеПараметры.
						ВыполняемоеОповещение.ДополнительныеПараметры.ОперацияСЭДОЧерезSaby Тогда
					НастройкиПодписи.НеВключатьЗаголовокXML = Ложь;
				КонецЕсли;
// BSLLS:MissingCodeTryCatchEx-off
			Исключение
			КонецПопытки;
// BSLLS:MissingCodeTryCatchEx-on
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

