
#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

Функция ИспользоватьСЭДО()
	
	Если Sedo_ЭДОСФСС.ПолучитьЗначениеФункциональнойОпции(ПрефиксПродукта() + "ИспользоватьЭЛН") Тогда

		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;       
	
КонецФункции

Функция РегистрационныйНомерСФР(Организация)
	
	Возврат Sedo_ЭДОСФССПовтИсп.Saby_РегистрационныйНомерСФР(Организация);
	
КонецФункции

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ОписаниеОповещения
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта //&НаКлиенте
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиенте
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяОбработки = ИмяОбработки();
 	ПутьКФормам = "Обработка."+ИмяОбработки+".Форма.";
	Возврат ПутьКФормам;
КонецФункции     

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность,,, ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыОбщийМодуль
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФункциональныеФормы
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

&НаКлиенте
&Вместо("ОтправитьСообщениеСЭДОФСС")
Процедура Sedo_ОтправитьСообщениеСЭДОФССЧерезОбработку(ПараметрыСообщения,
		ЗадаватьВопросОТестовомСервере,
		ОтображатьСостояние,
		ВыводитьДиалогСостоянияОтправки,
		СвойстваОбменаПоСЭДОЧерезОператора)

	Если ИспользоватьСЭДО() Тогда
		// У клиента стоит 1С-отчетность. Есть вызов метода из другого места с другими параметрами.
		// Если нет "ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка", то это не наш вызов.
		// + остальные параметры должны заполниться как надо.
		Попытка
			СсылкаНаДокумент = ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка;
			СодержимоеИлиАдресСообщения = ПараметрыСообщения.СодержимоеСообщения;
			ОповещениеОбратногоВызова = Новый ОписаниеОповещения(
				ПараметрыСообщения.ОповещениеОбратногоВызова.ИмяПроцедуры,
				ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль,
				Новый Структура);
		Исключение
			ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние,
								ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
			Возврат;
		КонецПопытки;
		ПараметрыСообщения.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
		ПараметрыСообщения.Вставить("СодержимоеИлиАдресСообщения", СодержимоеИлиАдресСообщения);
		ПараметрыСообщения.Вставить("РегистрационныйНомерФСС", РегистрационныйНомерСФР(ПараметрыСообщения.Организация));
		ПараметрыСообщения.Удалить("ОповещениеОбратногоВызова");
		Sedo_ЭДОСФССКлиент.ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);
	Иначе
		ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние,
							ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&Перед("ПодписатьФайлXMLDSig")
Процедура Sedo_ПодписатьФайлXMLDSig(СертификатПодписанта, ФайлДанных, ВыполняемоеОповещение, Знач ПодписанныйФайл, Кодировка, НастройкиПодписи)
	
	Если ТипЗнч(НастройкиПодписи) = Тип("Структура") Тогда
		Если НастройкиПодписи.Свойство("НеВключатьЗаголовокXML") = Истина Тогда
			Попытка
				Если ВыполняемоеОповещение.ДополнительныеПараметры.
						ВыполняемоеОповещение.ДополнительныеПараметры.ОперацияСЭДОЧерезSaby Тогда
					НастройкиПодписи.НеВключатьЗаголовокXML = Ложь;
				КонецЕсли;
// BSLLS:MissingCodeTryCatchEx-off
			Исключение
			КонецПопытки;
// BSLLS:MissingCodeTryCatchEx-on
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПолучитьВходящиеСообщенияСЭДОФСС")
Процедура Sedo_ПолучитьВходящиеСообщенияСЭДОФСС(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере, ПоказыватьДлительнуюОперацию, ТипВзаимодействия, ТипСообщенияОтвета, ОтображатьСостояние)
	
	Если ИспользоватьСЭДО() Тогда
		Попытка
			context_params = Sedo_ЭДОСФСС.ПолучитьНастройкиПодключения();
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОповещениеОбратногоВызова", ОповещениеОбратногоВызова);
			ПараметрыМетода.Вставить("Организации", Организации);
			ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОповещениеПолучитьВходящиеСообщенияСЭДО",
												Sedo_ЭДОСФССКлиент, ПараметрыМетода);
			ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
			ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
		Исключение
			ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере,
								ПоказыватьДлительнуюОперацию, ТипВзаимодействия, ТипСообщенияОтвета, ОтображатьСостояние);
			Возврат;
		КонецПопытки;
		
	Иначе
		ПродолжитьВызов(ОповещениеОбратногоВызова, Организации, ЗадаватьВопросОТестовомСервере,
							ПоказыватьДлительнуюОперацию, ТипВзаимодействия, ТипСообщенияОтвета, ОтображатьСостояние);
	КонецЕсли;
	
КонецПроцедуры
