
&НаКлиенте
&Вместо("ОтправитьСообщениеСЭДОФСС")
Процедура Sedo_ОтправитьСообщениеСЭДОФССЧерезОбработку(ПараметрыСообщения,
		ЗадаватьВопросОТестовомСервере,
		ОтображатьСостояние,
		ВыводитьДиалогСостоянияОтправки,
		СвойстваОбменаПоСЭДОЧерезОператора)

	Если ИспользоватьСЭДО() Тогда
		// У клиента стоит 1С-отчетность. Есть вызов метода из другого места с другими параметрами.
		// Если нет "ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка", то это не наш вызов.
		// + остальные параметры должны заполниться как надо.
		Попытка
			СсылкаНаДокумент = ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка;
			СодержимоеИлиАдресСообщения = ПараметрыСообщения.СодержимоеСообщения;
			ОповещениеОбратногоВызова = Новый ОписаниеОповещения(
				ПараметрыСообщения.ОповещениеОбратногоВызова.ИмяПроцедуры,
				ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль,
				Новый Структура);
		Исключение
			ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние,
								ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
			Возврат;
		КонецПопытки;
		ПараметрыСообщения.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
		ПараметрыСообщения.Вставить("СодержимоеИлиАдресСообщения", СодержимоеИлиАдресСообщения);
		ПараметрыСообщения.Вставить("РегистрационныйНомерФСС", РегистрационныйНомерСФР(ПараметрыСообщения.Организация));
		ПараметрыСообщения.Удалить("ОповещениеОбратногоВызова");
		Sedo_ЭДОСФССКлиент.ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);
	Иначе
		ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние,
							ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
	КонецЕсли;

КонецПроцедуры

