
&НаКлиенте
&Вместо("ОтправитьСообщениеСЭДОФСС")
Процедура Sedo_ОтправитьСообщениеСЭДОФССЧерезОбработку(ПараметрыСообщения,
		ЗадаватьВопросОТестовомСервере,
		ОтображатьСостояние,
		ВыводитьДиалогСостоянияОтправки,
		СвойстваОбменаПоСЭДОЧерезОператора)

	Если ИспользоватьСЭДО() Тогда
		Попытка
			ПараметрыСообщения.Вставить("СсылкаНаДокумент",
											ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль.Объект.Ссылка);
			ПараметрыСообщения.Вставить("СодержимоеИлиАдресСообщения",
											ПараметрыСообщения.СодержимоеСообщения);
			ПараметрыСообщения.Вставить("РегистрационныйНомерФСС", РегистрационныйНомерСФР(ПараметрыСообщения.Организация));
			ОповещениеОбратногоВызова = Новый ОписаниеОповещения(
				ПараметрыСообщения.ОповещениеОбратногоВызова.ИмяПроцедуры,
				ПараметрыСообщения.ОповещениеОбратногоВызова.Модуль,
				Новый Структура);
			ПараметрыСообщения.Удалить("ОповещениеОбратногоВызова");
			МодульЭДОСФССКлиент().ОтправитьСообщениеСЭДО(ОповещениеОбратногоВызова, ПараметрыСообщения);
		Исключение
			ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние, ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
		КонецПопытки;
	Иначе
		ПродолжитьВызов(ПараметрыСообщения, ЗадаватьВопросОТестовомСервере, ОтображатьСостояние, ВыводитьДиалогСостоянияОтправки, СвойстваОбменаПоСЭДОЧерезОператора);
	КонецЕсли;

КонецПроцедуры

