
#Область include_sickleave_base_CommonModule_ИменаМодулейСерверСЭДО
#КонецОбласти

Функция СвойстваОрганизацииДляОбмена(ОрганизацияСсылка, ПолучитьРегистрационныйНомерФСС = Истина, ПолучитьОГРН = Ложь, ПолучитьКодПодчиненностиФСС = Ложь, ПолучитьИННКППиСНИЛС = Истина) Экспорт
	
	ПараметрыСообщенияЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Результат = ПараметрыСообщенияЭДО.СвойстваОрганизацииДляОбмена(
		ОрганизацияСсылка,
		ПолучитьРегистрационныйНомерФСС,
		ПолучитьОГРН,
		ПолучитьКодПодчиненностиФСС,
		ПолучитьИННКППиСНИЛС
	);
	
	ОтпечаткиСертификатов = ПараметрыСообщенияЭДО.ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС(
		ОрганизацияСсылка
	);
	Если ОтпечаткиСертификатов = Неопределено Тогда
		ВызватьИсключение("У организации " + ОрганизацияСсылка.Наименование + " не настроен обмен с ФСС. Не указан сертификат страхователя.");
	КонецЕсли;
	Результат.Вставить("СертификатСтрахователяОтпечаток", ОтпечаткиСертификатов.СертификатСтрахователяОтпечаток);	
	
	
	Возврат Результат;
	
КонецФункции

Функция Saby_НашаОрганизация(Организация, ДобавитьСвойства = Истина) Экспорт
	Если СтрДлина(СокрЛП(Организация.ИНН)) = 10 Тогда
		НашаОрганизация = Новый Структура("СвЮЛ", Новый Структура);
		СвойстваОрганизации = МодульЭДОСФССПовтИсп().СвойстваОрганизацииДляОбмена(Организация);
		СвойстваОрганизации.Вставить("Ссылка", Организация);
		Если ДобавитьСвойства Тогда
			НашаОрганизация.Вставить("СвойстваОрганизации", СвойстваОрганизации);
		КонецЕсли;
		НашаОрганизация.СвЮЛ.Вставить("ИНН", СвойстваОрганизации.ИНН);
		НашаОрганизация.СвЮЛ.Вставить("КПП", СвойстваОрганизации.КПП);	
	Иначе
	    НашаОрганизация = Новый Структура("СвФЛ", Новый Структура);
		СвойстваОрганизации = МодульЭДОСФССПовтИсп().СвойстваОрганизацииДляОбмена(Организация);
		СвойстваОрганизации.Вставить("Ссылка", Организация);
		Если ДобавитьСвойства Тогда
			НашаОрганизация.Вставить("СвойстваОрганизации", СвойстваОрганизации);
		КонецЕсли;
		НашаОрганизация.СвФЛ.Вставить("ИНН", СвойстваОрганизации.ИНН);
    КонецЕсли;

	Возврат НашаОрганизация;
КонецФункции	

Функция Saby_РегистрационныйНомерСФР(Организация) Экспорт
	Возврат Организация.РегистрационныйНомерСФР;
КонецФункции	
