
#Область include_sickleave_base_CommonModule_ИменаМодулейСерверСЭДО
#КонецОбласти

Функция СвойстваОрганизацииДляОбмена(ОрганизацияСсылка, ПолучитьРегистрационныйНомерФСС = Истина, ПолучитьОГРН = Ложь, ПолучитьКодПодчиненностиФСС = Ложь, ПолучитьИННКППиСНИЛС = Истина) Экспорт
	
	ПараметрыСообщенияЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Результат = ПараметрыСообщенияЭДО.СвойстваОрганизацииДляОбмена(
		ОрганизацияСсылка,
		ПолучитьРегистрационныйНомерФСС,
		ПолучитьОГРН,
		ПолучитьКодПодчиненностиФСС,
		ПолучитьИННКППиСНИЛС
	);
	
	ОтпечаткиСертификатов = ПараметрыСообщенияЭДО.ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС(
		ОрганизацияСсылка
	);
	Если ОтпечаткиСертификатов = Неопределено Тогда
		ВызватьИсключение("У организации " + ОрганизацияСсылка.Наименование + " не настроен обмен с ФСС. Не указан сертификат страхователя.");
	КонецЕсли;
	Результат.Вставить("СертификатСтрахователяОтпечаток", ОтпечаткиСертификатов.СертификатСтрахователяОтпечаток);	
	
	
	Возврат Результат;
	
КонецФункции

Функция Saby_НашаОрганизация(Организация) Экспорт
	Если СтрДлина(СокрЛП(Организация.ИНН)) = 10 Тогда
		НашаОрганизация = Новый Структура("СвЮЛ", Новый Структура);
		СвойстваОрганизации = МодульЭДОСФССПовтИсп().СвойстваОрганизацииДляОбмена(Организация);
		СвойстваОрганизации.Вставить("Ссылка", Организация);
		НашаОрганизация.Вставить("СвойстваОрганизации", СвойстваОрганизации);
		НашаОрганизация.СвЮЛ.Вставить("ИНН", СвойстваОрганизации.ИНН);
		НашаОрганизация.СвЮЛ.Вставить("КПП", СвойстваОрганизации.КПП);	
	Иначе
	    НашаОрганизация = Новый Структура("СвФЛ", Новый Структура);
		СвойстваОрганизации = МодульЭДОСФССПовтИсп().СвойстваОрганизацииДляОбмена(Организация);
		СвойстваОрганизации.Вставить("Ссылка", Организация);
		НашаОрганизация.Вставить("СвойстваОрганизации", СвойстваОрганизации);
		НашаОрганизация.СвФЛ.Вставить("ИНН", СвойстваОрганизации.ИНН);
    КонецЕсли;

	Возврат НашаОрганизация;
КонецФункции	

Функция Saby_РегистрационныйНомерСФР(Организация) Экспорт
	Возврат Организация.РегистрационныйНомерСФР;
КонецФункции	


Функция ПодтипВложенияПоТипуСообщения(ТипСообщения) Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(6,	"SEDI_CONFIRM");
	Соответствие.Вставить(84,	"SEDI_PAY_STATUS_REQUEST");
	Соответствие.Вставить(86,	"SEDI_INSURANT_REQUEST");   
	Соответствие.Вставить(101,	"SEDI_SAPP_CONFIRM");
	Соответствие.Вставить(104,	"SEDI_TERMINATION_REQUEST");
	Соответствие.Вставить(109,	"SEDI_LIFE_EVENT");
	Соответствие.Вставить(120,	"SEDI_DISABILITY_REQUEST");
	Соответствие.Вставить(320,	"SEDI_INSURED_PERSON_SALARY_REQUEST");
	Соответствие.Вставить(1000,	"SEDI_APPEAL_RESP");
		
	Возврат Соответствие.Получить(Число(ТипСообщения));
	
КонецФункции    

Функция ИмяФормыПоТипуСообщения(ТипСообщения) Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(84,	"Запрос состояния выплат пособия по ВНиМ");
	Соответствие.Вставить(86,	"Сведения о застрахованном лице");   
	Соответствие.Вставить(101,	"Ответ на запрос проверки, подтверждения");
	Соответствие.Вставить(104,	"Уведомление о прекращении отпуска по уходу за ребенком до полутора лет");
	Соответствие.Вставить(109,	"Информация о жизненных событиях");
	Соответствие.Вставить(120,	"Возмещение расходов на оплату дополнительных выходных");
	Соответствие.Вставить(320,	"Запрос страхователя о получении от Фонда сведений о заработной плате застрахованного лица");
	Соответствие.Вставить(1000,	"Ответ страхователя на обращение");
		
	Возврат Соответствие.Получить(Число(ТипСообщения));
		
КонецФункции

Функция МассивОбрабатываемыхПодтиповВложений() Экспорт
	
	Массив = Новый Массив;
	
	Массив.Добавить("SEDI_UUID");
	
	Массив.Добавить("SEDI_ERROR");
	Массив.Добавить("SEDI_INSURANT_RESPONSE");
	Массив.Добавить("SEDI_INSURANT_MISMATCH");
	Массив.Добавить("SEDI_ELN_NOTICE");
	Массив.Добавить("SEDI_LIFE_EVENT_RESPONSE");
	Массив.Добавить("SEDI_SAPP_REQUEST");
	Массив.Добавить("SEDI_SAPP_RESPONSE");
	Массив.Добавить("SEDI_PAY_STATUS_CHANGE");
	Массив.Добавить("SEDI_PAY_STATUS_RESPONSE");
	Массив.Добавить("SEDI_TERMINATION_RESPONSE");
	
	// Для работы с извещениями ПВСО могут использоваться следующие подтипы:
	//  in 10 - SEDI_NOTICE - Извещение ПВСО;
	//  out 6 - SEDI_CONFIRM - подтверждение о прочтении;
	//  in 11 - SEDI_CONFIRM_RESPONSE - Квитанция о получении подтверждения ПВСО;
	Массив.Добавить("SEDI_NOTICE");
	Массив.Добавить("SEDI_CONFIRM");
	Массив.Добавить("SEDI_CONFIRM_RESPONSE");
	
	// Тип сообщения in 107: Информирование о событиях по проактивному процессу по временной нетрудоспособности и материнству
	Массив.Добавить("SEDI_PROCESS_INFORM");
	
	// Тип сообщения 321: Результат обработки запроса страхователя о получении от Фонда сведений о заработной плате застрахованного лица
	Массив.Добавить("SEDI_INSURED_PERSON_SALARY_RESPONSE");
	
	// Заявление о возмещении расходов на оплату дополнительных выходных дней для ухода за детьми-инвалидами
	//  out 120 - ДокументСЭДО/SEDI_DISABILITY_REQUEST  - заявление страхователя
	//  in  121 - ДокументСЭДО/SEDI_DISABILITY_RESPONSE - ответ
	//  in  122 - ДокументСЭДО/SEDI_DISABILITY_REJECT   - отказ от СФР
	Массив.Добавить("SEDI_DISABILITY_REQUEST");
	Массив.Добавить("SEDI_DISABILITY_RESPONSE");
	Массив.Добавить("SEDI_DISABILITY_REJECT");

	Массив.Добавить("SEDI_APPEAL_REQ");   // in  1001 - ДокументСЭДО/SEDI_APPEAL_REQ  - Обращение СФР к страхователю (обязательный)
	Массив.Добавить("SEDI_APPEAL_RESP");  // out 1000 - ДокументСЭДО/SEDI_APPEAL_RESP - Ответ страхователя на обращение СФР (необязательный)
	Массив.Добавить("SEDI_APPEAL_NOTIF"); // in  1002 - ДокументСЭДО/SEDI_APPEAL_REQ  - протокол
	
	Возврат Массив;
	
КонецФункции 

Функция ВерсияФорматаПоТипуСообщения(ТипСообщения) Экспорт
	
	// 320 сообщение // Запрос данных о среднем заработке // SEDI_INSURED_PERSON_SALARY_REQUEST
	Если Число(ТипСообщения) = 320 Тогда
		Возврат "1.1";
	Иначе
		Возврат "1.0";
	КонецЕсли;
	
КонецФункции
