
Функция СведенияОПодписанте(Сотрудник, СсылкаМЧДФСС)

	Если ТипЗнч(Сотрудник) = Тип("Строка") Тогда
		Возврат СведенияОПодписантеИзСтроки(Сотрудник, СсылкаМЧДФСС);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВидДокумента", "");

	ФИО = Новый Структура("Фамилия, Имя, Отчество");
	ДанныеФИО = РегистрыСведений.ФИОСотрудников.ПолучитьПоследнее(ТекущаяДатаСеанса(),
					Новый Структура("Сотрудник", Сотрудник));
	ЗаполнитьЗначенияСвойств(ФИО, ДанныеФИО);

	Паспорт = Сотрудник.Документ;
	ПаспортныеДанные = Новый Структура;
	ПаспортныеДанные.Вставить("Номер", "");
	ПаспортныеДанные.Вставить("Серия", "");
	ПаспортныеДанные.Вставить("ВыдавшийОрган", "");
	ПаспортныеДанные.Вставить("АдресРегистрации", "");
	ПаспортныеДанные.Вставить("ФактическийАдрес", "");
	Если ЗначениеЗаполнено(Паспорт) Тогда
		ПаспортныеДанные.Вставить("Номер", Паспорт.НомерДокумента);
		ПаспортныеДанные.Вставить("Серия", Паспорт.СерияДокумента);
		ПаспортныеДанные.Вставить("ВыдавшийОрган", Паспорт.КемВыдан);

		Результат.Вставить("ВидДокумента", СокрЛП(Паспорт.ВидДокумента));
	КонецЕсли;

	АдресРегистрацииВид = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("АдресРегистрацииСотрудника");
	АдресПроживанияВид = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("АдресМестаЖительстваСотрудника");
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(АдресРегистрацииВид);
	ВидыКИ.Добавить(АдресПроживанияВид);
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Сотрудник,, ВидыКИ);
	СтрокаКИ = ТаблицаКИ.Найти(АдресРегистрацииВид, "Вид");
	Если СтрокаКИ <> Неопределено Тогда
		ПаспортныеДанные.Вставить("АдресРегистрации", СтрокаКИ.Представление);
	КонецЕсли;
	СтрокаКИ = ТаблицаКИ.Найти(АдресПроживанияВид, "Вид");
	Если СтрокаКИ <> Неопределено Тогда
		ПаспортныеДанные.Вставить("ФактическийАдрес", СтрокаКИ.Представление);
	КонецЕсли;

	Результат.Вставить("ФИО", ФИО);
	Результат.Вставить("СНИЛС", Сотрудник.СтраховойНомерПФ);
	Результат.Вставить("ИНН", Сотрудник.ИНН);
	Результат.Вставить("Пол", СокрЛП(Сотрудник.Пол));
	Результат.Вставить("ПаспортныеДанные", ПаспортныеДанные);

	Возврат Результат;

КонецФункции

Функция СведенияОбОрганизации(Организация)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Результат = Новый Структура;
		Результат.Вставить("ИНН", Организация.ИНН);
		Результат.Вставить("КПП", Организация.КПП);
		Результат.Вставить("Название", Организация.НаименованиеСокращенное);
		Результат.Вставить("НазваниеПолное", Организация.НаименованиеПолное);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОбОрганизацииПредставителя(Представитель)

	Результат = Неопределено;
	ПредОрганизация = Неопределено;

	ТаблицаРаботы = ОбщегоНазначенияСервер.ТаблицаРаботыСотрудника(Неопределено, Представитель,
									КонецДня(ТекущаяДатаСеанса()),,,,,Истина);
	Для Каждого СтрокаТЗ Из ТаблицаРаботы Цикл
		ПредОрганизация = СтрокаТЗ.Организация;
		Прервать;
	КонецЦикла;

	Результат = СведенияОбОрганизации(ПредОрганизация);

	Возврат Результат;

КонецФункции

