
Функция ПолучитьРеквизитыФизическогоЛица(Сотрудник)

	РеквизитыФизическогоЛица = Новый Структура();

	РеквизитыФизическогоЛица.Вставить("СтраховойНомерПФР", Сотрудник.СтраховойНомерПФ);
	СтруктураФИО = РегистрыСведений.ФИОСотрудников.ПолучитьПоследнее(
		МестноеВремя(ТекущаяУниверсальнаяДата(), "Europe/Moscow"),
		Новый Структура("Сотрудник", Сотрудник));
	РеквизитыФизическогоЛица.Вставить("Фамилия",  СтруктураФИО.Фамилия);
	РеквизитыФизическогоЛица.Вставить("Имя",      СтруктураФИО.Имя);
	РеквизитыФизическогоЛица.Вставить("Отчество", СтруктураФИО.Отчество);

	Возврат РеквизитыФизическогоЛица;

КонецФункции

