
Функция ПолучитьСотрудникаИзДокумента(СсылкаНаДокумент)

	Сотрудник = Неопределено;

	// Сообщение 120:
	Если СокрЛП(ТипЗнч(СсылкаНаДокумент)) = "Заявления о возмещении расходов, опись документов и заявлений" Тогда
		Сотрудник = СсылкаНаДокумент.ТаблицаПриложения[0].ФИО;
	// Сообщение 1000:
	ИначеЕсли СокрЛП(ТипЗнч(СсылкаНаДокумент)) = "Ответ страхователя на обращение СФР" Тогда
		Попытка
			Сотрудник = Пользователи.ТекущийПользователь().ФизическоеЛицо;
		Исключение
			ВызватьИсключение "У текущего пользователя (справочник Пользователи) не указано физическое лицо!";
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			ВызватьИсключение "У текущего пользователя (справочник Пользователи) не указано физическое лицо!";
		КонецЕсли;
	Иначе
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СсылкаНаДокумент,
			"Сотрудник"
		);
	КонецЕсли;

	Возврат Сотрудник;

КонецФункции

