
#Область include_sickleave_base_CommonModule_ДанныеМЧДФСССведения
#КонецОбласти

Функция СведенияОПодписантеИзСтроки(Сотрудник, СсылкаМЧДФСС)
	
	Результат = Новый Структура;
	Результат.Вставить("ВидДокумента", "");

	ФИО = Новый Структура("Фамилия, Имя, Отчество");
	МассивФИО = СтрРазделить82(Сотрудник, " ", Ложь);
	Если МассивФИО.Количество() > 0 Тогда
		ФИО.Фамилия = МассивФИО[0];
	КонецЕсли;
	Если МассивФИО.Количество() > 1 Тогда
		ФИО.Имя = МассивФИО[1];
	КонецЕсли;
	Если МассивФИО.Количество() > 2 Тогда
		ФИО.Отчество = МассивФИО[2];
	КонецЕсли;
	
	ПаспортныеДанные = Новый Структура;
	ПаспортныеДанные.Вставить("Номер", "");
	ПаспортныеДанные.Вставить("Серия", "");
	ПаспортныеДанные.Вставить("ВыдавшийОрган", "");
	ПаспортныеДанные.Вставить("АдресРегистрации", "");
	ПаспортныеДанные.Вставить("ФактическийАдрес", "");

	Результат.Вставить("ФИО", ФИО);
 	Результат.Вставить("СНИЛС", СсылкаМЧДФСС.ЛицоБезДовФЛ_СНИЛС);
	Результат.Вставить("ИНН", СсылкаМЧДФСС.ЛицоБезДовФЛ_ИНН);
	Результат.Вставить("Пол", "");
	Результат.Вставить("ПаспортныеДанные", ПаспортныеДанные);

	Возврат Результат;
	
КонецФункции

Функция ДанныеПоМЧДФСС(СсылкаМЧДФСС)

	Результат = Новый Структура;
	
	///////////////////////////////////////////////////////////////////////////////
	// Сведения.Доверенность
	///////////////////////////////////////////////////////////////////////////////
	// Блок Сведения.Доверенность используется для создания доверенности в кабинете
	///////////////////////////////////////////////////////////////////////////////
	Доверенность = Новый Структура;
	Доверенность.Вставить("Номер", СсылкаМЧДФСС.Код);
	Доверенность.Вставить("Дата", Формат(СсылкаМЧДФСС.ДатаВыдачи, "ДФ=yyyy-MM-dd"));
	Доверенность.Вставить("ДатаОкончания", Формат(СсылкаМЧДФСС.ДатаОкончания, "ДФ=yyyy-MM-dd"));
	Доверенность.Вставить("Полномочия", "Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,"
									  + "Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,"
									  + "Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Нет,Да");
	Доверенность.Вставить("ПравоПередоверия", "Нет");
	Доверенность.Вставить("Разрешения", "Да,Нет,Нет,Нет,Нет,Нет,Нет,Нет");
	
	///////////////////////////////////////////////////////////////////////////////
	// Сведения о доверителе: Организация
	ДоверительСвЮЛ = СведенияОбОрганизации(СсылкаМЧДФСС.Доверитель);
	Если ДоверительСвЮЛ = Неопределено Тогда
		ДоверительСвЮЛ = Новый Структура;
		ДоверительСвЮЛ.Вставить("ИНН", СсылкаМЧДФСС.ДоверительЮЛ_ИНН);
		ДоверительСвЮЛ.Вставить("КПП", СсылкаМЧДФСС.ДоверительЮЛ_КПП);
		ДоверительСвЮЛ.Вставить("Название", СокрЛП(СсылкаМЧДФСС.Доверитель));
		ДоверительСвЮЛ.Вставить("НазваниеПолное", СсылкаМЧДФСС.ДоверительЮЛ_НаимОрг);
	КонецЕсли;
	ДоверительОрг = Новый Структура;
	ДоверительОрг.Вставить("СвЮЛ", ДоверительСвЮЛ);
	// Сведения о доверителе: Подписант
	ДовПодписант = СведенияОПодписанте(СсылкаМЧДФСС.ЛицоБезДовФЛ, СсылкаМЧДФСС);
	// Сведения о доверителе: Доверитель
	Доверитель = Новый Структура;
	Доверитель.Вставить("Организация", ДоверительОрг);
	Доверитель.Вставить("Подписант", ДовПодписант);
	
	///////////////////////////////////////////////////////////////////////////////
	// Сведения о представителе: Организация
	//  = организация-доверитель, если нет организации, человек делается сотрудником в кабинете
	// у человека подпись в кабинете: Сотрудник - Доступ - Подписи
	// у сотрудника доступ к кабинету
	// галка у подписи - используется для сдачи отчетности
	// сотрудник выбран в качестве представителя	
	ПредОрганизация = ДоверительСвЮЛ;
	// Сведения о представителе: Подписант
	ПредПодписант = СведенияОПодписанте(СсылкаМЧДФСС.Представитель, СсылкаМЧДФСС);
	// Сведения о представителе:
	ДоверенноеЛицо = Новый Структура;
	ДоверенноеЛицо.Вставить("Подписант", ПредПодписант);
	ДоверенноеЛицо.Вставить("Организация", Новый Структура("СвЮЛ", ПредОрганизация));
	
	// Доверенность
	Доверенность.Вставить("Доверитель", Доверитель);
	Доверенность.Вставить("ДоверенноеЛицо", ДоверенноеЛицо);
	
	///////////////////////////////////////////////////////////////////////////////
	// Сведения.Пакет.Доверенность
	///////////////////////////////////////////////////////////////////////////////
	// Блок Пакет.Доверенность используется для передачи информации о доверителе
	//  и уполномоченном представителе в контейнер отправки.
	///////////////////////////////////////////////////////////////////////////////
	ПакетДоверенность = Новый Структура;
	ПакетДоверенность.Вставить("Номер", СсылкаМЧДФСС.Код);
	ПакетДоверенность.Вставить("ДатаНачалаДействия", Доверенность.Дата);
	ПакетДоверенность.Вставить("ДатаОкончанияДействия", Доверенность.ДатаОкончания);
	ПакетДоверенность.Вставить("МЧД", Новый Структура("ИдФСС", СсылкаМЧДФСС.НомерДоверенности));
	
	// = ОРГ-доверитель = СвЮЛ из Сведения.Доверенность
	Доверитель = Новый Структура;
	Доверитель.Вставить("ИНН", ДоверительСвЮЛ.ИНН);
	Доверитель.Вставить("КПП", ДоверительСвЮЛ.КПП);
	Доверитель.Вставить("Название", ДоверительСвЮЛ.Название);
	
	// = ОРГ-уполномоченный представитель
	Представитель = Новый Структура;
	Представитель.Вставить("ИНН", ПредОрганизация.ИНН);
	Представитель.Вставить("КПП", ПредОрганизация.КПП);
	Представитель.Вставить("Имя", ПредОрганизация.Название);
	
	ПакетДоверенность.Вставить("Доверитель", Доверитель);
	ПакетДоверенность.Вставить("УполномоченныйПредставитель", Представитель);
	
	///////////////////////////////////////////////////////////////////////////////
	Результат.Вставить("Доверенность", Доверенность);
	Результат.Вставить("ПакетДоверенность", ПакетДоверенность);
	
	Возврат Результат;
	
КонецФункции	

