
Функция КонтактнаяИнформацияИзДанныхФЛ(РеквизитыФизическогоЛица, Вид)
	Результат = "";
	Попытка
		КонтактнаяИформация = get_prop(РеквизитыФизическогоЛица, "КонтактнаяИнформация");
		Если ТипЗнч(КонтактнаяИформация) <> Тип("Массив") Тогда
			Возврат Результат;
		КонецЕсли;
		Для Каждого ЭлементКИ Из КонтактнаяИформация Цикл
			ВидЭлементаКИ = get_prop(ЭлементКИ, "Вид");
			Если get_prop(ВидЭлементаКИ, "Представление") = Вид Тогда
				Результат = get_prop(ЭлементКИ, "Значение");
			КонецЕсли;
		КонецЦикла;
	Исключение
		Возврат "";
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция СведенияОПодписанте(ФизЛицо, СсылкаМЧДФСС)

	Если ТипЗнч(ФизЛицо) = Тип("Строка") Тогда
		Возврат СведенияОПодписантеИзСтроки(ФизЛицо, СсылкаМЧДФСС);
	КонецЕсли;

	Результат = Новый Структура;
	
	ФЛ = Новый Структура("Ссылка, ИмяСБИС", ФизЛицо, "ЧастноеЛицо");
	РеквизитыФизическогоЛица = ПолучитьРеквизитыФизическогоЛица(ФЛ);
	
	ФИО = Новый Структура;
	ФИО.Вставить("Фамилия", get_prop(РеквизитыФизическогоЛица, "Фамилия", ""));
	ФИО.Вставить("Имя", get_prop(РеквизитыФизическогоЛица, "Имя", ""));
	ФИО.Вставить("Отчество", get_prop(РеквизитыФизическогоЛица, "Отчество", ""));
	
	ПаспортныеДанные = Новый Структура;
	ПаспортныеДанные.Вставить("Номер", get_prop(РеквизитыФизическогоЛица, "ДокументНомер", ""));
	ПаспортныеДанные.Вставить("Серия", get_prop(РеквизитыФизическогоЛица, "ДокументСерия", ""));
	ПаспортныеДанные.Вставить("ВыдавшийОрган", get_prop(РеквизитыФизическогоЛица, "ДокументКемВыдан", ""));
	ПаспортныеДанные.Вставить("АдресРегистрации",
									КонтактнаяИнформацияИзДанныхФЛ(РеквизитыФизическогоЛица, "Адрес по прописке"));
	Если НЕ ЗначениеЗаполнено(ПаспортныеДанные.АдресРегистрации) Тогда
		ПаспортныеДанные.Вставить("АдресРегистрации",
										КонтактнаяИнформацияИзДанныхФЛ(РеквизитыФизическогоЛица, "Адрес регистрации"));
	КонецЕсли;
	ПаспортныеДанные.Вставить("ФактическийАдрес",
									КонтактнаяИнформацияИзДанныхФЛ(РеквизитыФизическогоЛица, "Адрес места проживания"));
	Если НЕ ЗначениеЗаполнено(ПаспортныеДанные.ФактическийАдрес) Тогда
		ПаспортныеДанные.Вставить("ФактическийАдрес",
										КонтактнаяИнформацияИзДанныхФЛ(РеквизитыФизическогоЛица, "Адрес места жительства"));
	КонецЕсли;
	
	Результат.Вставить("ФИО", ФИО);
	Результат.Вставить("СНИЛС", get_prop(РеквизитыФизическогоЛица, "СНИЛС", ""));
	Результат.Вставить("ИНН", get_prop(РеквизитыФизическогоЛица, "ИНН", ""));
	Пол = get_prop(РеквизитыФизическогоЛица, "Пол");
	Результат.Вставить("Пол", get_prop(Пол, "Представление", ""));
	ДокументВид = get_prop(РеквизитыФизическогоЛица, "ДокументВид");
	Результат.Вставить("ВидДокумента", get_prop(ДокументВид, "Представление", ""));
	Результат.Вставить("ПаспортныеДанные", ПаспортныеДанные);
	
	Возврат Результат;
	
КонецФункции	

Функция СведенияОбОрганизации(Организация)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Организация) И ТипЗнч(Организация) <> Тип("Строка") Тогда
		ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
		ОрганизацияАПИ3 = ОбработкаСБИС.Api3Object(Организация, "НашаОрганизация"); // API3-объект организации
		Параметры = Новый Структура("object", ОрганизацияАПИ3);
		СведенияОбОрганизации = ВыполнитьINI("Blockly_Организации_read", "main", Параметры);
		// Могут вернуть и массив с элементом
		Если ТипЗнч(СведенияОбОрганизации) = Тип("Массив") Тогда
			СведенияОбОрганизации = СведенияОбОрганизации[0];
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить("ИНН", get_prop(СведенияОбОрганизации, "ИНН", ""));
		Результат.Вставить("КПП", get_prop(СведенияОбОрганизации, "КПП", ""));
		Результат.Вставить("Название", get_prop(СведенияОбОрганизации, "Название", ""));
		Результат.Вставить("НазваниеПолное", get_prop(СведенияОбОрганизации, "Название", ""));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

