
Функция СведенияОПодписанте(ФизЛицо, СсылкаМЧДФСС)

	Если ТипЗнч(ФизЛицо) = Тип("Строка") Тогда
		Возврат СведенияОПодписантеИзСтроки(ФизЛицо, СсылкаМЧДФСС);
	КонецЕсли;

	Результат = Новый Структура;
	
	ДанныеФизическогоЛицаТЗ = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизЛицо),
		"Фамилия, Имя, Отчество, ФИОПолные, ФамилияИО, ИНН, Пол, СтраховойНомерПФР, АдресПоПропискеПредставление, 
		|АдресМестаПроживанияПредставление, ДокументВид, ДокументСерия, ДокументНомер, ДокументКемВыдан",
		ТекущаяДатаСеанса());
		
	Если ДанныеФизическогоЛицаТЗ.Количество() > 0 Тогда
		ДанныеФЛ = ДанныеФизическогоЛицаТЗ[0];
		
		ФИО = Новый Структура;
		ФИО.Вставить("Фамилия", ДанныеФЛ.Фамилия);
		ФИО.Вставить("Имя", ДанныеФЛ.Имя);
		ФИО.Вставить("Отчество", ДанныеФЛ.Отчество);
		
		ПаспортныеДанные = Новый Структура;
		ПаспортныеДанные.Вставить("Номер", ДанныеФЛ.ДокументНомер);
		ПаспортныеДанные.Вставить("Серия", ДанныеФЛ.ДокументСерия);
		ПаспортныеДанные.Вставить("ВыдавшийОрган", ДанныеФЛ.ДокументКемВыдан);
		ПаспортныеДанные.Вставить("АдресРегистрации", ДанныеФЛ.АдресПоПропискеПредставление);
		ПаспортныеДанные.Вставить("ФактическийАдрес", ДанныеФЛ.АдресМестаПроживанияПредставление);
		
		Результат.Вставить("ФИО", ФИО);
		Результат.Вставить("СНИЛС", ДанныеФЛ.СтраховойНомерПФР);
		Результат.Вставить("ИНН", ДанныеФЛ.ИНН);
		Результат.Вставить("Пол", СокрЛП(ДанныеФЛ.Пол));
		Результат.Вставить("ВидДокумента", СокрЛП(ДанныеФЛ.ДокументВид));
		Результат.Вставить("ПаспортныеДанные", ПаспортныеДанные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СведенияОбОрганизацииПредставителя(Представитель)
	
	Результат = Неопределено;
	ПредОрганизация = Неопределено;
	
	Если СокрЛП(ТипЗнч(Представитель)) = "Физическое лицо" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сотрудники.ГоловнаяОрганизация КАК Организация
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.ФизическоеЛицо = &ФизЛицо";
		Запрос.УстановитьПараметр("ФизЛицо", Представитель);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаРЗ Из РезультатЗапроса Цикл
			ПредОрганизация = СтрокаРЗ.Организация;
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредОрганизация) Тогда
		СписокПоказателей = Новый Массив;
		СписокПоказателей.Добавить("ИННЮЛ");
		СписокПоказателей.Добавить("КППЮЛ");
		СписокПоказателей.Добавить("НаимЮЛСокр");
		СписокПоказателей.Добавить("НаимЮЛПол");
		
		СведенияОбОрганизации = ЗарплатаКадрыБазовый.ПолучитьСведенияОбОрганизации(ПредОрганизация,
									ТекущаяДатаСеанса(), СписокПоказателей);
		
		Результат = Новый Структура;
		Результат.Вставить("ИНН", СведенияОбОрганизации.ИННЮЛ);
		Результат.Вставить("КПП", СведенияОбОрганизации.КППЮЛ);
		Результат.Вставить("Название", СведенияОбОрганизации.НаимЮЛСокр);
		Результат.Вставить("НазваниеПолное", СведенияОбОрганизации.НаимЮЛПол);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

