
Функция ПолучитьСотрудникаИзДокумента(СсылкаНаДокумент)

	Сотрудник = Неопределено;

	// Сообщение 120:
	Если СокрЛП(ТипЗнч(СсылкаНаДокумент)) = "Заявление в СФР о возмещении выплат родителям детей-инвалидов" Тогда
		Сотрудник = СсылкаНаДокумент.Оплаты[0].Сотрудник;
	// Сообщение 84:
	ИначеЕсли СокрЛП(ТипЗнч(СсылкаНаДокумент)) = "Запрос статусов выплаты пособия" Тогда
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ФизическоеЛицо");
	// Сообщение 1000:
	ИначеЕсли СокрЛП(ТипЗнч(СсылкаНаДокумент)) = "Ответ страхователя на обращение СФР" Тогда
		Попытка
			Сотрудник = Пользователи.ТекущийПользователь().ФизическоеЛицо;
		Исключение
			ВызватьИсключение "У текущего пользователя (справочник Пользователи) не указано физическое лицо!";
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			ВызватьИсключение "У текущего пользователя (справочник Пользователи) не указано физическое лицо!";
		КонецЕсли;
	Иначе
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СсылкаНаДокумент,
			"Сотрудник"
		);
	КонецЕсли;

	Возврат Сотрудник;

КонецФункции

