
Функция ПолучитьРеквизитыФизическогоЛица(Сотрудник)
	
	// Для физ.лица
	Если СокрЛП(ТипЗнч(Сотрудник)) = "Физическое лицо" Тогда
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сотрудник,
					"Фамилия, Имя, Отчество, СтраховойНомерПФР");
	КонецЕсли;
	
	// Для сотрудника
	РеквизитыФизическогоЛица = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"),
		"Фамилия, Имя, Отчество, СтраховойНомерПФР");

	Возврат РеквизитыФизическогоЛица;

КонецФункции

