
Функция ПолучитьСотрудникаИзДокумента(СсылкаНаДокумент)

	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	
	// Получим сотрудника или физ.лицо из инишки документа
	ДокументАПИ3 = ОбработкаСБИС.Api3Object(СсылкаНаДокумент, ""); // API3-объект документа
	Параметры = Новый Структура("object", ДокументАПИ3);
	ТипДокумента = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаДокумент)).Имя;
	ДокументАПИ3 = ВыполнитьINI("Blockly_" + ТипДокумента + "_read", "main", Параметры);
	// Могут вернуть и массив с элементом
	Если ТипЗнч(ДокументАПИ3) = Тип("Массив") Тогда
		ДокументАПИ3 = ДокументАПИ3[0];
	КонецЕсли;
	
	СотрудникАПИ3 = get_prop(ДокументАПИ3, "Сотрудник"); // API3-объект сотрудника или частного лица
	Если НЕ ЗначениеЗаполнено(СотрудникАПИ3) Тогда
		ВызватьИсключение "Не указан сотрудник в документе: " + СсылкаНаДокумент;
	КонецЕсли;
	
	// Получим ссылку на объект 1с
	МассивТипов = СтрРазделить82(СотрудникАПИ3.ИмяИС, ".");
	ТипСправочника = МассивТипов[1];
	СсылкаОбъекта = Справочники[ТипСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(СотрудникАПИ3.ИдИС));
	
	Результат = Новый Структура("Ссылка, ИмяСБИС", СсылкаОбъекта, СотрудникАПИ3.ИмяСБИС);
	
	Возврат Результат;

КонецФункции

