
Функция ПолучитьРеквизитыФизическогоЛица(Сотрудник)
	
	ОбработкаСБИС = Обработки[ИмяОбработки()].Создать();
	
	// Если это сотрудник - получаем частное лицо
	Если Сотрудник.ИмяСБИС = "Сотрудник" Тогда
		ОбъектАПИ3 = ОбработкаСБИС.Api3Object(Сотрудник.Ссылка, "");
		МассивТипов = СтрРазделить82(ОбъектАПИ3.ИмяИС, ".");
		ТипСправочника = МассивТипов[1];
		
		Параметры = Новый Структура("object", ОбъектАПИ3); 
		ДанныеСотрудника = ВыполнитьINI("Blockly_" + ТипСправочника + "_read", "main", Параметры);
		ДанныеСотрудника = get_prop(ДанныеСотрудника, "ЧастноеЛицо");
	// Если это частное лицо - просто берём его
	Иначе
		ДанныеСотрудника = ОбработкаСБИС.Api3Object(Сотрудник.Ссылка, "ЧастноеЛицо");
	КонецЕсли;
	
	// Получаем данные частного лица
	МассивТипов = СтрРазделить82(ДанныеСотрудника.ИмяИС, ".");
	ТипСправочника = МассивТипов[1];
	
	Параметры = Новый Структура("object", ДанныеСотрудника); // API3-объект частного лица
	ДанныеФизЛица = ВыполнитьINI("Blockly_" + ТипСправочника + "_read", "main", Параметры);
	Если ТипЗнч(ДанныеФизЛица) = Тип("Массив") Тогда
		ДанныеФизЛица = ДанныеФизЛица[0];
	КонецЕсли;
	
	Возврат ДанныеФизЛица;

КонецФункции

